Revit 2027 API
StairsPathType.ArrowheadTypeId Property
 The arrow head type of the stairs path.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId ArrowheadTypeId { get; set; }
Public Property ArrowheadTypeId As ElementId
	Get
	Set
public:
property ElementId^ ArrowheadTypeId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member ArrowheadTypeId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The arrowheadTypeId is not a valid start symbol or arrowhead type.
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
StairsPathType Class
Autodesk.Revit.DB.Architecture Namespace